#include <iostream>
#include <fstream>
#include <string>
#include <ctime>

using namespace std;

int main(){
    srand(time(0));
    string F[10] = {"Алексей", "Дмитрий", "Иван", "Сергей", "Андрей", "Максим", "Егор", "Владимир", "Павел", "Никита"};
    string I[10] = {"Иванов", "Петров", "Сидоров", "Смирнов", "Кузнецов", "Попов", "Васильев", "Новиков", "Фёдоров", "Морозов"};
    string O[10] = {"Алексеевич", "Дмитриевич", "Иванович", "Сергеевич", "Андреевич", "Максимович", "Егорович", "Владимирович", "Павлович", "Никитич"};
    string D[10] = {"Солнце светит ярко сегодня","Кофе утром — лучшее начало","Книги открывают новые миры","Дождь стучит по окну","Звёзды мерцают в ночи","Ветер шепчет среди деревьев","Мечты ведут к целям","Улыбка дарит тепло другим","Путешествия расширяют кругозор всегда","Тишина лечит уставшую душу"};

    int c;
    cout << endl << "введите количство строк: ";
    cin >> c; 

    string filename = "list1.txt";
    ofstream file1(filename);

    for(int i = 0; i < c; i++){
        file1 << rand() % 31 + 1 << " " << rand() % 12 + 1 << " " << rand() % 25 + 2000 << "\t" << I[rand() % 10] << " " << F[rand() % 10] << " " << O[rand() % 10] << " " << rand() % 100+1 << " " << D[rand()%10]  << endl;
    }

    file1.close();

    return 0;
}
